perf/test/spaceflight-news-stress.yaml
config:
  environments:
    base:
      target: 'http://localhost:5555/base'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
    cache:
      target: 'http://localhost:5555/cache'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
    replication:
      target: 'http://localhost:5555/replication'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"
    rateLimiting:
      target: 'http://localhost:5555/rate-limiting'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Initial Ramp
      duration: 30
      arrivalRate: 10
      rampTo: 300
    - name: Sustained High Load
      duration: 90
      arrivalRate: 300

scenarios:
  - name: Spaceflight-news
    flow:
      - get:
          url: '/spaceflight_news'